app/views/posts/index.html.erb

SELECT "posts".* FROM "posts" WHERE "posts"."category_id" = $1  [["category_id", 1]]
---
<ul>
  <% @category.posts.each do |post| %>