app/views/categories/show.html.erb

<ul>
  <% @category.posts.each do |post| %>
---
SELECT "posts".* FROM "posts" WHERE "posts"."category_id" = $1  [["category_id", 1]]